TexasInstruments/f29h85x-mcal/drivers/Cdd_Xbar/include/Cdd_Xbar_Priv.h
/*********************************************************************************************************************
 *  COPYRIGHT
 *  ------------------------------------------------------------------------------------------------------------------
 *  \verbatim
 *
 *                 TEXAS INSTRUMENTS INCORPORATED PROPRIETARY INFORMATION
 *
 *                 Property of Texas Instruments, Unauthorized reproduction and/or distribution
 *                 is strictly prohibited. This product is protected under copyright law and
 *                 trade secret law as an unpublished work.
 *                 (C) Copyright 2025 Texas Instruments Inc. All rights reserved.
 *
 *  \endverbatim
 *  ------------------------------------------------------------------------------------------------------------------
 *  FILE DESCRIPTION
 *  ------------------------------------------------------------------------------------------------------------------
 *  File:        Cdd_Xbar_Priv.h
 *  Generator:   None
 *
 *  Description: Private header file for CDD XBar IP related source
 *********************************************************************************************************************/

#ifndef CDD_XBAR_PRIV_H
#define CDD_XBAR_PRIV_H
/** \addtogroup CDD_XBAR
 *  @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*********************************************************************************************************************
 * Header Files
 *********************************************************************************************************************/
#include "hw_memmap.h"
#include "hw_types.h"
#include "hw_input_xbar.h"
#include "hw_output_xbar.h"
#include "hw_epwm_xbar.h"
#include "hw_clb_xbar.h"
#include "hw_mdl_xbar.h"
#include "hw_icl_xbar.h"
#include "hw_xbar.h"

/*********************************************************************************************************************
 * Version Check (if required)
 *********************************************************************************************************************/

/* None */

/*********************************************************************************************************************
 * Exported Preprocessor #define Constants
 *********************************************************************************************************************/
/** \brief Bit corresponding to the locking in the lock register */
#define CDD_XBAR_LOCK_BIT                          1U
/** \brief Shift value for lock key */
#define CDD_XBAR_LOCK_KEY_SHIFT                    16U
/** \brief Key for locking */
#define CDD_XBAR_LOCK_KEY                          0x5A5A  
/** \brief Offset value for output Xbar flag registers  */
#define XBAR_OUTPUTXBAR_FLAGS_OFFSET               0x1000U


/*********************************************************************************************************************
 * Exported Preprocessor #define Macros
 *********************************************************************************************************************/

/* None */

/*********************************************************************************************************************
 * Exported Type Declarations
 *********************************************************************************************************************/

/* None */

/*********************************************************************************************************************
 * Exported Object Declarations
 *********************************************************************************************************************/
/** \brief CDD XBAR initialization status */
typedef enum
{
    /** \brief Driver in uninitialized state */
    CDD_XBAR_UNINIT = 0U,
    /** \brief Driver in init state */
    CDD_XBAR_INIT = 1U,
    /** \brief Complete driver instances in lock state */
    CDD_XBAR_LOCK = 2U,
} Cdd_Xbar_StatusType;

/*********************************************************************************************************************
 *  Exported Function Prototypes
 *********************************************************************************************************************/
#if (STD_ON == CDD_XBAR_API_ENABLE)
#if (0U < CDD_XBAR_INPUT_XBAR_CONFIGURATIONS)
/* Design: MCAL-25761 */
/** \brief Selects input crossbar input
 *
 * Function to select a GPIO or Logic High (1) / Low (0) as input to input crossbar.
 *
 * \param[in] InputSelect is the pointer to INPUT XBAR input select.
 * \param[in] InputLine is the pointer to INPUT XBAR input line.
 * \param[in] Selection is the selection updation for the identified inputs.
 * \pre Input crossbar select line should not be in locked state.
 * \post None
 * \return Status of selection.
 * \retval E_OK if input selected successfully.
 * \retval E_NOT_OK if input selection failed.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) \
Cdd_Xbar_InSelect(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) InputSelect, 
                  P2CONST(uint16, AUTOMATIC, CDD_XBAR_CONST) InputLine, 
                  VAR(boolean, AUTOMATIC) Selection);

/* Design: MCAL-25767 */
/** \brief Locks input crossbar select line.
 *
 * Function to lock an unlocked input crossbar select. Locking prevents further input selection updation. 
 * Once locked, will remain locked unless system reset.
 *
 * \param[in] InputSelect is the pointer to INPUT XBAR input select.
 * \pre Input crossbar select line should not be in locked state.
 * \post None
 * \return Status of locking input select line.
 * \retval E_OK if locked successfully.
 * \retval E_NOT_OK if locking failed.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_InSelectLock(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) InputSelect);

/* Design: MCAL-25768 */
/** \brief Returns input crossbar select line lock status.
 *
 * Function to get the lock status of an input select line.
 *
 * \param[in] InputSelect is the pointer to INPUT XBAR input select.
 * \pre None
 * \post None
 * \return Current input select lock enablement status.
 * \retval TRUE if locked.
 * \retval FALSE if not locked.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_InSelectLockStatus(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) InputSelect);
#endif /* 0U < CDD_XBAR_INPUT_XBAR_CONFIGURATIONS*/

/* Design: MCAL-25769 */
/** \brief Returns output crossbar lock status.
 *
 * Function to check lock status of output crossbar.
 *
 * \pre None
 * \post None
 * \return Current lock status of output crossbar.
 * \retval TRUE if locked.
 * \retval FALSE if not locked.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_OutLockStatus(void);

/* Design: MCAL-25770 */
/** \brief Locks output crossbar.
 *
 * Function to entirely Lock all output crossbar units. Locking impacts input 
 * line selection updation and output inversion. Once locked, it cannot be 
 * unlocked unless system reset.
 *
 * \pre Output crossbar should not be in locked state.
 * \post None
 * \return Status of locking.
 * \retval E_OK if locked successfully.
 * \retval E_NOT_OK if locking failed.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_OutLock(void);

/* Design: MCAL-25762 */
#if (0U < CDD_XBAR_OUTPUT_XBAR_CONFIGURATIONS)
/** \brief Selects output crossbar input.
 *
 * Function to select or deselect a chosen input of the output crossbar according to the Selection.
 *
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \param[in] InputLine is the pointer to OUTPUT XBAR input line.
 * \param[in] Selection TRUE : select an input, FALSE : deselect an input.
 * \pre Output crossbar should not be in locked state.
 * \post None
 * \return Status of selection.
 * \retval E_OK if selected successfully.
 * \retval E_NOT_OK if selection failed.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_OutSelect
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, P2CONST(uint16, AUTOMATIC, CDD_XBAR_CONST) InputLine, 
VAR(boolean, AUTOMATIC) Selection);

/* Design: MCAL-25772 */
/** \brief Invert/Uninvert the output crossbar output.
 *
 * Function to invert or uninvert a chosen output of the output crossbar according to the Selection.
 *
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \param[in] Selection TRUE : Inverts the output, FALSE : Uninvert the output.
 * \pre Output crossbar should not be in locked state.
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_OutOutputInvert
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, P2CONST(boolean, AUTOMATIC, CDD_XBAR_CONST) Selection);

