TexasInstruments/f29h85x-mcal/drivers/Cdd_Xbar/include/Cdd_Xbar_Priv.h
/* Design: MCAL-25771 */
/** \brief Returns output crossbar output inversion status.
 *
 * Function to check inversion for an output of the given output crossbar.
 *
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \pre None
 * \post None
 * \return Status of Inversion.
 * \retval TRUE if inverted.
 * \retval FALSE if uninverted.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_OutOutputInvertCheck(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);

/* Design: MCAL-25773 */
/** \brief Returns status of output crossbar output inversion before latch.
 *
 * Function to check inversion before latching for an output of the given output crossbar.
 *
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \pre None
 * \post None
 * \return Status of inversion set before latch.
 * \retval TRUE if inverted.
 * \retval FALSE if uninverted.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_OutputInvLatchSts(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);

/* Design: MCAL-25775 */
/** \brief Selects/deselects the latch as the output crossbar output.
 *
 * Function to select or deselect the output latch to drive an output of the Output Crossbar unit.
 *
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \param[in] Selection TRUE : Latched event selected as output, FALSE : Latched event not selected as output.
 * \pre Driver should be in initialized state.
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_OutputLatchSelect(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, 
P2CONST(boolean, AUTOMATIC, CDD_XBAR_CONST) Selection);

/* Design: MCAL-25774*/
/** \brief Returns the status of selecting latch as output of output crossbar .
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \pre None
 * \post None
 * \return Enablement status of setting latched event as output.
 * \retval TRUE if latched event selected as output.
 * \retval FALSE if latch event not selected as output.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_OutputLatchSelectSts(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);

/* Design: MCAL-28156 */
/** \brief Returns the status of output latch of the given output of Output Crossbar.
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \pre None
 * \post None
 * \return Output latch status.
 * \retval TRUE if latched output.
 * \retval FALSE if no input latched output.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_OutputLatchFlagStatus(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);

/* Design: MCAL-28157 */
/** \brief Forces the output latch of the given output of Output Crossbar.
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_OutputLatchFlagForce(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);


/* Design: MCAL-28158 */
/** \brief Clears the output latch of the given output of Output Crossbar.
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_OutputLatchFlagClear(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);


/* Design: MCAL-28155 */
/** \brief Inverts and restores output inversion before latch for a chosen output XBAR output.
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line to be inverted before latch.
 * \param[in] Selection TRUE : invert, FALSE : uninvert.
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_OutputInvLatch
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, P2CONST(boolean, AUTOMATIC, CDD_XBAR_CONST) Selection);


/* Design: MCAL-25776 */
/** \brief Stretch or unstretch an output of output crossbar.
 *
 * Function to stretch or unstretch a chosen output line of the output crossbar unit. 
 * Ticks for unstretching = CDD_XBAR_SYSTICKS_STRETCH_OFF.
 *
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \param[in] Ticks Ticks to stretch.
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_OutputStretchPulse
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, 
P2CONST(Cdd_Xbar_TickStretchType, AUTOMATIC, CDD_XBAR_CONST) Ticks);

/* Design: MCAL-25777 */
/** \brief Returns the status of output stretch on an output of the output crossbar.
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \pre None
 * \post None
 * \return Output Stretch or Unstretch.
 * \retval TRUE if stretch is enabled.
 * \retval FALSE if stretch is not enabled.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_OutputStretchOrNot(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);

/* Design: MCAL-25778 */
/** \brief Returns the output stretch on an output of an output crossbar.
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \pre None
 * \post None
 * \return Output stretch in system clock ticks.
 * \retval CDD_XBAR_SYSTICKS_16 or CDD_XBAR_SYSTICKS_32  if stretch selected.
 * \retval CDD_XBAR_SYSTICKS_STRETCH_OFF if stretch not selected.
 *
 *********************************************************************************************************************/
FUNC(Cdd_Xbar_TickStretchType, CDD_XBAR_CODE) Cdd_Xbar_OutputStretchGet
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);

/* Design: MCAL-25779 */
/** \brief Returns the output signal state on output crossbar output.
 *
 * Function to check output signal state as either Low (0) or High (1) status on
 * an output of the Output Crossbar.
 *
 * \param[in] OutputLine is the pointer to the OUTPUT XBAR output line.
 * \pre None
 * \post None
 * \return Output polarity.
 * \retval STD_HIGH if Logic High (1).
 * \retval STD_LOW if Logic Low (0).
 *
 *********************************************************************************************************************/
FUNC(Cdd_Xbar_OutputlevelType, CDD_XBAR_CODE) Cdd_Xbar_OutOutputState
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);
#endif /* 0U < CDD_XBAR_OUTPUT_XBAR_CONFIGURATIONS*/

/* Design: MCAL-25784 */
/** \brief Returns CLB crossbar lock status.
 * \pre None
 * \post None
 * \return CLB Crossbar Lock status.
 * \retval TRUE if locked.
 * \retval FALSE if not locked.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_ClbLockStatus(void);

/* Design: MCAL-25785 */
/** \brief Locks CLB crossbar.
 *
 * Function to entirely Lock all CLB Crossbar units. Locking prevents input 
 * line selection updation and output inversion. Once locked, it cannot be 
 * unlocked unless system reset.
 *
 * \pre CLB crossbar should not be in locked state.
 * \post None
 * \return CLB crossbar locking status.
 * \retval E_OK if locked successfully.
 * \retval E_OK if locking failed.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_ClbLock(void);

/* Design: MCAL-25764 */
#if (0U < CDD_XBAR_CLB_XBAR_CONFIGURATIONS)
/** \brief Selects CLB crossbar input.
 *
 * Function to select or deselect an input of the CLB crossbar unit according to the Selection.
 *
 * \param[in] OutputLine is the pointer to the CLB XBAR output line.
 * \param[in] InputLine is the pointer to the CLB XBAR input line.
 * \param[in] Selection TRUE : Select an input, FALSE : Deselect an input.
 * \pre CLB Crossbar should not be in locked state.
 * \post None
 * \return Status of input selection.
 * \retval E_OK if selection is successful.
 * \retval E_OK if selection failed.
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_ClbSelect(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, 
P2CONST(uint16, AUTOMATIC, CDD_XBAR_CONST) InputLine, VAR(boolean, AUTOMATIC) Selection);

/* Design: MCAL-25787 */
/** \brief Invert/Uninvert the CLB crossbar output.
 *
 * Function to invert or uninvert an output of the CLB crossbar according to the Selection.
 *
 * \param[in] OutputLine is the pointer to the CLB XBAR output line.
 * \param[in] Selection TRUE : Invert an output, FALSE : Uninverts an output.
 * \pre CLB Crossbar should not be in locked state.
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_ClbOutputInvert
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, P2CONST(boolean, AUTOMATIC, CDD_XBAR_CONST) Selection);

