TexasInstruments/f29h85x-mcal/drivers/Cdd_Xbar/include/Cdd_Xbar_Priv.h
/* Design: MCAL-25786 */
/** \brief Returns inversion status of CLB crossbar output .
 *
 * Function to check inversion status of an output of the CLB Crossbar.
 *
 * \param[in] OutputLine is the pointer to the CLB XBAR output line.
 * \pre None
 * \post None
 * \return Output Inversion.
 * \retval TRUE if inverted.
 * \retval FALSE if not inverted.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_ClbOutputInvertCheck(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);
#endif /* 0U < CDD_XBAR_CLB_XBAR_CONFIGURATIONS*/

/* Design: MCAL-25780 */
/** \brief Returns EPWM crossbar lock status.
 * \pre None
 * \post None
 * \return EPWM crossbar lock status.
 * \retval TRUE if locked.
 * \retval FALSE if not locked.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_EpwmLockStatus(void);

/* Design: MCAL-25781 */
/** \brief Locks EPWM crossbar.
 *
 * Function to entirely Lock all EPWM Crossbar units. Locking prevents input 
 * line selection updation and output inversion. Once locked, it cannot be 
 * unlocked unless system reset.
 *
 * \pre EPWM crossbar should not be in locked state.
 * \post None
 * \return EPWM crossbar locking status.
 * \retval E_OK if locked succesfully.
 * \retval E_NOT_OK if locking failed.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_EpwmLock(void);

/* Design: MCAL-25763 */
#if (0U < CDD_XBAR_EPWM_XBAR_CONFIGURATIONS)
/** \brief Selects EPWM crossbar input.
 *
 * Function to select or deselect an input of the EPWM crossbar unit according to the Selection.
 *
 * \param[in] OutputLine is the pointer to the EPWM XBAR output line.
 * \param[in] InputLine is the pointer to the EPWM XBAR input line.
 * \param[in] Selection TRUE : Select an input, FALSE : Deselect an input.
 * \pre EPWM crossbar should not be in locked state.
 * \post None
 * \return Input selection status.
 * \retval E_OK if selection is successful.
 * \retval E_NOT_OK if selection failed.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_EpwmSelect
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, P2CONST(uint16, AUTOMATIC, CDD_XBAR_CONST) InputLine, 
VAR(boolean, AUTOMATIC) Selection);

/* Design: MCAL-25783 */
/** \brief Inverts EPWM crossbar output.
 *
 * Function to invert or uninvert an output of the EPWM crossbar according to the Selection.
 *
 * \param[in] OutputLine is the pointer to the EPWM XBAR output line.
 * \param[in] Selection TRUE : Invert an output, FALSE : Uninvert an output.
 * \pre EPWM crossbar should not be in locked state.
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_EpwmOutputInvert
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, P2CONST(boolean, AUTOMATIC, CDD_XBAR_CONST) Selection);

/* Design: MCAL-25782 */
/** \brief Returns EPWM crossbar output inversion status.
 *
 * Function to check inversion on an output of the EPWM crossbar.
 *
 * \param[in] OutputLine is the pointer to the EPWM XBAR output line.
 * \pre None
 * \post None
 * \return Output inversion status.
 * \retval TRUE if inverted successfully.
 * \retval FALSE if invertion failed.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_EpwmOutputInvertCheck(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);
#endif /* 0U < CDD_XBAR_EPWM_XBAR_CONFIGURATIONS*/

/* Design: MCAL-25788 */
/** \brief Returns lock status of MINDB crossbar.
 * \pre None
 * \post None
 * \return MINDB Crossbar lock status.
 * \retval TRUE if locked.
 * \retval FALSE if not locked.
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_MdlLockStatus(void);

/* Design: MCAL-25789 */
/** \brief Locks MINDB Crossbar
 *
 * Function to entirely Lock all MINDB Crossbar units. Locking prevents input 
 * line selection updation and output inversion. Once locked, it cannot be 
 * unlocked unless system reset.
 *
 * \pre MINDB crossbar should not be in locked state.
 * \post None
 * \return MINDB crossbar locking status.
 * \retval E_OK if locked succesfully.
 * \retval E_NOT_OK if locking failed.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_MdlLock(void);

/* Design: MCAL-25765 */
#if (0U < CDD_XBAR_MINDB_XBAR_CONFIGURATIONS)
/** \brief Selects MINDB Crossbar Input.
 *
 * Function to select or deselect an input line of the MINDB Crossbar.
 *
 * \param[in] OutputLine is the pointer to the MINDB XBAR output line.
 * \param[in] InputLine is the pointer to the MINDB XBAR input line.
 * \param[in] Selection  TRUE : Select an input, FALSE : Deselect an input.
 * \pre MINDB crossbar should not be in locked state.
 * \post None
 * \return Input selection status.
 * \retval E_OK if selection is successful.
 * \retval E_NOT_OK if selection failed.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_MdlSelect
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, P2CONST(uint16, AUTOMATIC, CDD_XBAR_CONST) InputLine, 
VAR(boolean, AUTOMATIC) Selection);

/* Design: MCAL-25791 */
/** \brief Inverts MINDB crossbar output.
 *
 * Function to invert or uninvert an output of the MINDB Crossbar according to the Selection.
 *
 * \param[in] OutputLine is the pointer to the MINDB XBAR output line.
 * \param[in] Selection TRUE : Invert an input, FALSE : Uninvert an input.
 * \pre MINDB crossbar should not be in locked state.
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_MdlOutputInvert
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, P2CONST(boolean, AUTOMATIC, CDD_XBAR_CONST) Selection);

