TexasInstruments/f29h85x-mcal/drivers/Cdd_Xbar/include/Cdd_Xbar_Priv.h
/* Design: MCAL-25790 */
/** \brief Returns MINDB crossbar output inversion status.
 *
 * Function to check inversion on an output of the MINDB Crossbar.
 *
 * \param[in] OutputLine is the pointer to the MINDB XBAR output line.
 * \return Output inversion status.
 * \retval TRUE if inverted.
 * \retval FALSE if not inverted.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_MdlOutputInvertCheck(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);
#endif /* 0U < CDD_XBAR_MINDB_XBAR_CONFIGURATIONS*/

/* Design: MCAL-25792 */
/** \brief Returns lock status of ICL crossbar.
 * \pre None
 * \post None
 * \return ICL crossbar lock status.
 * \retval TRUE if locked.
 * \retval FALSE if not locked.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_IclLockStatus(void);

/* Design: MCAL-25793 */
/** \brief Locks ICL crossbar.
 *
 * Function to entirely Lock all ICL Crossbar units. Locking prevents input 
 * line selection updation and output inversion. Once locked, it cannot be 
 * unlocked unless system reset.
 *
 * \pre ICL crossbar should not be in locked state.
 * \post None
 * \return ICL crossbar locking status.
 * \retval E_OK if locked succesfully.
 * \retval E_NOT_OK if locking failed.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_IclLock(void);


#if (0U < CDD_XBAR_ICL_XBAR_CONFIGURATIONS)
/* Design: MCAL-25766 */
/** \brief Selects ICL crossbar input
 *
 * Function to select or deselect an input line of the ICL Crossbar unit.
 *
 * \param[in] OutputLine is the pointer to the ICL XBAR output line.
 * \param[in] InputLine is the pointer to the ICL XBAR input line.
 * \param[in] Selection  TRUE : Select an input, FALSE : Deselect an input.
 * \pre ICL crossbar should not be in locked state.
 * \post None
 * \return Input selection status.
 * \retval E_OK if selection is successful.
 * \retval E_NOT_OK if selection failed.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_IclSelect
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, P2CONST(uint16, AUTOMATIC, CDD_XBAR_CONST) InputLine, 
VAR(boolean, AUTOMATIC) Selection);

/* Design: MCAL-25795 */
/** \brief Inverts ICL Crossbar Output.
 *
 * Function to invert or uninvert an output of the ICL Crossbar.
 *
 * \param[in] OutputLine is the pointer to the ICL XBAR output line.
 * \param[in] Selection TRUE : Invert an input, FALSE : Uninvert an input.
 * \pre ICL Crossbar should not be in locked state.
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_IclOutputInvert
(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine, P2CONST(boolean, AUTOMATIC, CDD_XBAR_CONST) Selection);

/* Design: MCAL-25794 */
/** \brief Returns ICL Crossbar Output Inversion status.
 * Function to check inversion on an output line of the ICL Crossbar.
 *
 * \param[in] OutputLine is the pointer to the ICL XBAR output line.
 * \pre None
 * \post None
 * \return Output inversion status.
 * \retval TRUE if inverted.
 * \retval FALSE if not inverted.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_IclOutputInvertCheck(P2CONST(uint8, AUTOMATIC, CDD_XBAR_CONST) OutputLine);
#endif /* 0U < CDD_XBAR_ICL_XBAR_CONFIGURATIONS*/

#if (STD_ON == CDD_XBAR_INPUT_FLAG_API)
/* Design: MCAL-28160 */
/** \brief Clears a crossbar input flag.
 * \param[in] InputFlag is a crossbar input flag.
 * \pre none
 * \post None
 * \return None
 *********************************************************************************************************************/
FUNC(void, CDD_XBAR_CODE) Cdd_Xbar_InFlagClear(VAR(Cdd_Xbar_InputFlagType, AUTOMATIC) InputFlag);

/* Design: MCAL-28159 */
/** \brief Returns the status of a crossbar input flag.
 * \param[in] InputFlag is a crossbar input flag.
 * \pre None
 * \post None
 * \return Status of the crossbar input flag.
 * \retval TRUE if input was triggered.
 * \retval FALSE if input was not triggered.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_XBAR_CODE) Cdd_Xbar_InFlagStatus(VAR(Cdd_Xbar_InputFlagType, AUTOMATIC) InputFlag);
#endif /* STD_ON == CDD_XBAR_INPUT_FLAG_API */
#endif /* STD_ON == CDD_XBAR_API_ENABLE */ 

/*********************************************************************************************************************
 *  Exported Inline Function Definitions and Function-Like Macros
 *********************************************************************************************************************/

/* None */

#ifdef __cplusplus
}
#endif
/**
 * @}
 */
#endif /* CDD_XBAR_PRIV_H */

/*********************************************************************************************************************
 *  End of File: Cdd_Xbar_Priv.h
 *********************************************************************************************************************/
